In [1]:
import sqlite3
banco = sqlite3.connect('empresa.db')

In [2]:
# Criando um cursor para operar comandos SQL
cursor = banco.cursor()
# Criando uma tabela 'estudantes' com os campos nomeEstudante, idade, email
cursor.execute(
    "CREATE TABLE estudantes(idEstudante integer, nomeEstudante text, idade integer, email text, idDepartamento integer)")
# Inserindo dados na tabela
cursor.execute("INSERT INTO estudantes VALUES(1, 'Maria', 40, 'mariadosanjos@mentorama.com',2)")
banco.commit()
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print(cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2)]

In [3]:
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesa ordem dos tipos de dados
listaestudantes = [('2', 'Felipe', '18', 'felipe@mentorama.com', '1'),
                   ('3', 'Maria', '45', 'maria@mentorama.com', '4'),
                   ('4', 'João', '33', 'joao@mentorama.com', '4'),
                   ('5', 'Lucia', '17', 'lucia@mentorama.com', '2'),
                   ('6', 'Pedro', '32', 'pedro@mentorama.com', 'NULL'),
                   ('7', 'Izabela', '23', 'izabela@mentorama.com', '3'),
                   ('8', 'Eduardo', '59', 'eduardo@mentorama.com', '4'),
                   ('9', 'Tiago', '38', 'tiago@mentorama.com', '5'),
                   ('10', 'Ana', '25', 'ana@mentorama.com', 'NULL'),
                   ('11', 'Carol', '36', 'carol@mentorama.com', '2'),
                   ('12', 'Leonardo', '28', 'leonardo@mentorama.com', '3'),
                   ('13', 'Vanessa', '45', 'vanessa@mentorama.com', '4'),
                   ('14', 'João', '43', 'joaopedro@mentorama.com', '5'),
                   ('15', 'Mari', '25', 'mari@mentorama.com', '6')]
# Inserimos os dados da Lista dentroi da tabela
cursor.executemany("""INSERT INTO estudantes VALUES (?,?,?,?,?)""", listaestudantes)
print("Dados inseridos com sucesso")
banco.commit()

Dados inseridos com sucesso

In [4]:
# Conculta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print(cursor.fetchall())
print('Dados inseridos com sucesso')

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]
Dados inseridos com sucesso

WHERE
Vide figura (3) Ipad

In [5]:
# Seleciona dados da tablea estudantes onde a idade é especificada
cursor.execute("""SELECT * FROM estudantes WHERE idade = '33'""")
print(cursor.fetchall())

[(4, 'João', 33, 'joao@mentorama.com', 4)]

In [7]:
# Seleciona dados da tabela estudantes onde o nome é especificado
cursor.execute("""SELECT * FROM estudantes WHERE nomeEstudante = 'Felipe'""")
print(cursor.fetchall())

[(2, 'Felipe', 18, 'felipe@mentorama.com', 1)]

In [8]:
# Consulta dados geral da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print(cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

Operadores Lógicos - vide Ipad figura (4)

In [10]:
# Seleciona dados da tabela estudantes onde o nome e a idade são especificados
cursor.execute("SELECT * FROM estudantes WHERE nomeEstudante = 'Felipe' AND idade = '18' ")
print(cursor.fetchall())

[(2, 'Felipe', 18, 'felipe@mentorama.com', 1)]

In [11]:
# Vamos selecionar dados da tabela estudantes onde queremso retornar os registors que tenham o nome Maria OR possuam idade = 18
cursor.execute("SELECT * FROM estudantes WHERE nomeEstudante = 'Maria' OR idade = '18'")
print(cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4)]

In [13]:
# Vamos usar o operador NOT
# Vamos selecionar dados da tabela estudantes e retornar todos os registors que não tenham o nome Maria ou que a idade seja =18
cursor.execute("SELECT * FROM estudantes WHERE NOT nomeEstudante = 'Maria' OR idade = '18' ")
print(cursor.fetchall())

[(2, 'Felipe', 18, 'felipe@mentorama.com', 1), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

In [14]:
# Vamos selecionar dados da tabela estudantes e retornar todos os registros cujo o nome não seja Maria E que a idade seja maior que 18
cursor.execute("SELECT * FROM estudantes WHERE NOT nomeEstudante = 'Maria' AND idade > '18' ")
print(cursor.fetchall())

[(4, 'João', 33, 'joao@mentorama.com', 4), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

ORDER BY
Ordem ascendente/crescente (ASC)
Ordem decrescente (DESC)

In [15]:
cursor.execute("SELECT nomeEstudante, idade FROM estudantes ORDER BY idade ASC")
print(cursor.fetchall())

[('Lucia', 17), ('Felipe', 18), ('Izabela', 23), ('Ana', 25), ('Mari', 25), ('Leonardo', 28), ('Pedro', 32), ('João', 33), ('Carol', 36), ('Tiago', 38), ('Maria', 40), ('João', 43), ('Maria', 45), ('Vanessa', 45), ('Eduardo', 59)]

GROUP BY
Voce pode solicitar que as linhas retornadas sejam classificads por um dos campos escolhidos

In [16]:
cursor.execute("SELECT nomeEstudante, idDepartamento FROM estudantes GROUP BY nomeEstudante")
print(cursor.fetchall())

[('Ana', 'NULL'), ('Carol', 2), ('Eduardo', 4), ('Felipe', 1), ('Izabela', 3), ('João', 4), ('Leonardo', 3), ('Lucia', 2), ('Mari', 6), ('Maria', 2), ('Pedro', 'NULL'), ('Tiago', 5), ('Vanessa', 4)]

SELECT COUNT/AVG/SUM
A função COUNT() retorno o número de linhas que correspondem a um critério especificado

In [17]:
sql = """SELECT COUNT(nomeEstudante) FROM estudantes WHERE nomeEstudante = 'Maria'"""
cursor.execute(sql)
print(cursor.fetchall())

[(2,)]

A função AVG() retorna o valor médio de uma coluna numérica

In [18]:
sql = """SELECT AVG(idade) FROM estudantes WHERE idade > '18'"""
cursor.execute(sql)
cursor.fetchall()

[(36.30769230769231,)]

A função SUM() retorna a soma total de uma coluna numérica - somar todas as idades maior que 18

In [19]:
sql = """SELECT SUM(idade) FROM estudantes WHERE idade > '18'"""
cursor.execute(sql)
cursor.fetchall()

[(472,)]